{
  "backend/main.mo": "Main Motoko actor defining appointment management system with access control, blob storage mixins, user profiles, and CRUD operations for appointments with role-based authorization (admin-only for listing/updating, public for creating).",
  "feature_evidence.json": "Feature evidence report documenting implementation of Vijaya Children's Clinic branding (logo, color scheme, clinic information, taglines) across frontend components with high confidence test mappings.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files describing React components, pages, hooks, and utilities for the clinic appointment booking system with Internet Identity authentication and staff portal.",
  "frontend/index.css": "Tailwind CSS base styles with OKLCH color variables for light and dark themes, defining design tokens for background, foreground, primary, secondary, destructive, border, and sidebar colors.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, title 'Vijaya Children's Clinic', root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for landing, booking, confirmation, and staff pages, wrapped in QueryClientProvider with shared layout including header, footer, profile modal, and toaster.",
  "frontend/src/components/AppointmentDateFilter.tsx": "Date filter component with preset buttons (Today, This Week, This Month), custom date range picker using Popover and Calendar, and clear filters functionality.",
  "frontend/src/components/AppointmentSearchBar.tsx": "Search input component with search icon, placeholder text for filtering by patient/child name or phone, and clear button that appears when text is entered.",
  "frontend/src/components/AppointmentStatusBadge.tsx": "Badge component displaying appointment status with color-coded styling (yellow for pending, blue for confirmed, green for completed, gray for cancelled).",
  "frontend/src/components/AppointmentStatusDropdown.tsx": "Select dropdown component for changing appointment status with four options (Pending, Confirmed, Completed, Cancelled) that triggers onStatusChange callback with appointment index and new status.",
  "frontend/src/components/ClinicDetailsSection.tsx": "Displays clinic contact information, services, and a QR code in a two-column card layout with gradient background. Shows phone number, timings, address, and a list of pediatric services offered.",
  "frontend/src/components/LoginButton.tsx": "Provides authentication UI with login/logout functionality using Internet Identity. Handles authentication state, displays loading spinner during login, and clears query cache on logout.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name for staff profile setup. Automatically shows when user is authenticated but has no profile data.",
  "frontend/src/components/SiteFooter.tsx": "Footer component displaying clinic information in three columns (about, contact, services) with copyright notice and caffeine.ai attribution. Includes doctor credentials and Tamil tagline.",
  "frontend/src/components/SiteHeader.tsx": "Sticky header with logo, navigation menu (Home, Book Appointment, Staff), and responsive mobile menu. Highlights active route and provides navigation functionality.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on authentication state. Handles anonymous and authenticated actors, initializes access control with admin token, and invalidates dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for managing user login/logout state. Creates AuthClient with configurable options, handles identity persistence, and exposes authentication status and methods through React context.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for appointment and user profile operations (create, list, get, save) with extensive logging and error handling. Integrates with the actor from useActor hook and manages query invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining the Vijaya Children's Clinic color palette (cyan, green, blue) for both light and dark modes, including brand-specific color scales.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and wraps the App component with InternetIdentityProvider and QueryClientProvider.",
  "frontend/src/pages/BookAppointmentPage.tsx": "Patient-facing appointment booking form with validation for parent/child details, date/time selection, and submission via useCreateAppointment hook. Includes time slot selection and navigates to confirmation page on success.",
  "frontend/src/pages/BookingConfirmationPage.tsx": "Confirmation page displayed after successful appointment booking, showing next steps and clinic contact information with navigation options to return home or book another appointment.",
  "frontend/src/pages/LandingPage.tsx": "Clinic homepage featuring hero section with doctor credentials, clinic features, services offered, and navigation buttons to booking and staff portal pages.",
  "frontend/src/pages/StaffAppointmentsPage.tsx": "Staff portal page for managing appointments with authentication check, role-based access control (admin/user), date filtering, search functionality, and appointment status updates. Includes extensive logging for debugging.",
  "frontend/src/utils/dateFilters.ts": "Provides date filtering utilities for appointments including conversion from bigint timestamps, date range calculations (today/week/month/custom), and filtering appointment arrays by date criteria.",
  "frontend/src/utils/searchFilter.ts": "Implements text-based search filtering for appointments by matching query strings against parent name, child name, and phone number fields.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for parameters like admin tokens.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes (including Vijaya clinic brand colors in cyan/green/blue), container settings, border radius variables, and typography/animation plugins.",
  "project_state.json": "Project metadata describing a dual-interface application with a public Vijaya Children's Clinic website and private staff portal for appointment management, including branding requirements and feature tracking."
}