{
  "backend/main.mo": "Backend actor managing appointment requests and user profiles with access control for viewing profiles and listing appointments.",
  "feature_evidence.json": "Feature evidence report mapping logo and theme updates to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and key behavior of major frontend components and pages.",
  "frontend/index.css": "Global Tailwind base styles and OKLCH CSS variables defining light/dark theme tokens.",
  "frontend/index.html": "Base HTML document mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main app router setup defining layout and routes for landing, booking, confirmation, and staff pages.",
  "frontend/src/components/ClinicDetailsSection.tsx": "Component showing services, additional care, contact info, and clinic details using styled cards.",
  "frontend/src/components/LoginButton.tsx": "Authentication button handling Internet Identity login/logout with loading and error handling.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting authenticated staff to save their name if no profile exists, with validation and mutation handling.",
  "frontend/src/components/SiteFooter.tsx": "Renders the clinic footer with contact info, services, and a dynamic year plus a caffeine.ai attribution link.",
  "frontend/src/components/SiteHeader.tsx": "Provides a responsive site header with logo, navigation buttons, and a toggleable mobile menu.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth context with login, logout, and identity loading via Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for creating appointments, listing appointments, and managing the caller's user profile.",
  "frontend/src/index.css": "Configures Tailwind base styles, custom color variables, dark mode themes, and background styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/BookAppointmentPage.tsx": "Displays a form for booking appointments, validates inputs, submits to backend, and redirects on success.",
  "frontend/src/pages/BookingConfirmationPage.tsx": "Displays a confirmation message after an appointment request is submitted and provides phone info plus navigation buttons.",
  "frontend/src/pages/LandingPage.tsx": "Renders the clinic landing page with hero branding, feature highlights, and buttons to book appointments or access the staff portal.",
  "frontend/src/pages/StaffAppointmentsPage.tsx": "Shows staff-only appointment listings with authentication, loading/error states, and formatted appointment details.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme colors, typography, animations, and extended utilities for the project.",
  "project_state.json": "Project state describing current features, requirements, theme notes, and image usage rules for the clinic website."
}