{
  "backend/main.mo": "Main actor implementing appointment booking system with staff authentication, role-based access control, user profiles, and appointment management using mixins for storage and authorization.",
  "backend/migration.mo": "Migration module that adds an initial staff user 'vijaya' with password 'vijaya' to the staffUserMap during canister upgrades.",
  "feature_evidence.json": "Feature evidence report documenting the StaffLoginForm authentication flow with localStorage token storage via useStaffAuth hook.",
  "frontend-file-summaries.txt": "Pre-generated summaries of frontend files including pages, components, hooks, and utilities for the Vijaya Children's Clinic appointment booking application.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color variables for light and dark themes, including custom properties for UI components like cards, buttons, and sidebar.",
  "frontend/index.html": "HTML entry point for the Vijaya Children's Clinic React application with root div and module script reference.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for landing, booking, staff, and admin pages, wrapped in QueryClientProvider with shared layout including header, footer, and toaster.",
  "frontend/src/components/AddStaffModal.tsx": "Dialog modal component for creating new staff accounts with userId, password, and optional email fields, using useCreateStaff mutation hook.",
  "frontend/src/components/AppointmentDateFilter.tsx": "Date filter component with preset buttons (Today, This Week, This Month), custom date range picker, and clear filters functionality for appointment filtering.",
  "frontend/src/components/AppointmentSearchBar.tsx": "Search input component with search icon and clear button for filtering appointments by patient name, child name, or phone number.",
  "frontend/src/components/AppointmentStatusBadge.tsx": "Displays an appointment status as a colored badge with appropriate styling for pending, confirmed, completed, and cancelled states.",
  "frontend/src/components/AppointmentStatusDropdown.tsx": "Provides a dropdown select component to change appointment status with options for pending, confirmed, completed, and cancelled.",
  "frontend/src/components/ClinicDetailsSection.tsx": "Renders a section displaying clinic services, contact information, timings, address, and a QR code in a two-column card layout.",
  "frontend/src/components/EditStaffModal.tsx": "Modal dialog for editing staff account details including password, email, and activation status with form validation and submission handling.",
  "frontend/src/components/LoginButton.tsx": "Empty file with no content.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts admin users to enter their name for profile setup, preventing dismissal until completed.",
  "frontend/src/components/SiteFooter.tsx": "Footer component displaying clinic information, contact details, services, and attribution with a three-column responsive layout.",
  "frontend/src/components/SiteHeader.tsx": "Sticky header with logo, desktop/mobile navigation menu for Home, Book Appointment, Staff, and Admin Login routes.",
  "frontend/src/components/StaffLoginForm.tsx": "Staff login form with user ID and password fields, error handling, and loading states for authentication.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages backend actor instances with Internet Identity authentication, handling anonymous and authenticated states while invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for appointment management (create, list, update status) and user profile operations (get, save) with automatic cache invalidation and error handling.",
  "frontend/src/hooks/useStaffAuth.ts": "Manages staff authentication flow combining Internet Identity with username/password credentials, storing auth state in localStorage with 24-hour expiration.",
  "frontend/src/hooks/useStaffManagement.ts": "Provides React Query hooks for CRUD operations on staff users (get all, create, update, delete) with toast notifications and cache invalidation.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom color variables for Vijaya Children's Clinic branding (cyan, green, blue) in both light and dark modes using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page that enforces admin role authorization, displays profile setup modal if needed, and provides navigation to staff management with logout functionality.",
  "frontend/src/pages/AdminLoginPage.tsx": "Admin login page using Internet Identity for biometric authentication with automatic redirect to admin dashboard upon successful authentication.",
  "frontend/src/pages/BookAppointmentPage.tsx": "Appointment booking form with patient details, date/time selection from predefined slots (7-9 PM), form validation, and submission to backend with navigation to confirmation page.",
  "frontend/src/pages/BookingConfirmationPage.tsx": "Confirmation page displayed after appointment booking with next steps information, contact details, and navigation options to home or booking another appointment.",
  "frontend/src/pages/LandingPage.tsx": "Main landing page featuring clinic hero section with doctor details, service offerings (newborn care, vaccination, etc.), feature highlights, and navigation to booking and staff portals.",
  "frontend/src/pages/StaffAppointmentsPage.tsx": "Staff portal for viewing and managing appointments with authentication check, date/search filtering, status updates, and appointment list display with detailed patient information.",
  "frontend/src/pages/StaffManagementPage.tsx": "Admin-only page for managing staff users with role-based access control, staff list display with search, add/edit/delete operations, and profile setup modal for new admins.",
  "frontend/src/utils/dateFilters.ts": "Provides date filtering utilities for appointment requests, including conversion from bigint timestamps, date range calculations (today/week/month/custom), and filtering functions to match appointments against date criteria.",
  "frontend/src/utils/searchFilter.ts": "Implements text-based search filtering for appointments by matching query strings against parent name, child name, and phone number fields.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes (including vijaya-cyan/green/blue palettes), container settings, border radius variables, and extended theme properties using OKLCH color space.",
  "project_state.json": "Project state tracking document indicating a bug fix request for staff portal authentication where 'vijaya'/'vijaya' credentials return unauthorized error, with pending requirements to fix backend authentication and verify user storage."
}