{
  "kind": "build_request",
  "title": "Replace site logo with newly uploaded white-background logo and match theme colors",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-12",
      "text": "Replace the current site logo image used throughout the app with the newly uploaded logo image, keeping the logo exactly as-is with its white background (no transparency), and ensure it renders crisply at common breakpoints.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Pls change the existing logo with this logo",
          "Use white background",
          "Apply the changes",
          "Please apply changes"
        ]
      },
      "acceptanceCriteria": [
        "The header logo (<img> in SiteHeader) displays the newly uploaded logo with its original white background intact.",
        "The landing page hero logo displays the newly uploaded logo with its original white background intact.",
        "No instances of the previous logo remain anywhere in the UI (header, hero, and any other branding locations).",
        "Logo remains sharp (no visible blur/pixelation) and maintains correct aspect ratio on mobile and desktop."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Update the global visual theme (Tailwind/CSS variables and any hard-coded color usages) so the site color palette matches the newly uploaded logo’s blue–green colors, and apply consistently across key pages (Landing, Book Appointment, Staff).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Match the theme with this new logo"
        ]
      },
      "acceptanceCriteria": [
        "Global theme tokens in frontend/src/index.css are updated to reflect the new logo’s blue/green palette (primary/secondary/accent/ring and derived custom scales as needed).",
        "Key UI elements (buttons, headings, badges, feature icons, gradients) visually align with the updated palette across Landing, Book Appointment, and Staff pages.",
        "Hard-coded blues/greens that materially conflict with the updated palette are replaced with theme tokens (e.g., using text-primary, bg-primary, etc.) so future palette changes propagate consistently."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Keep the backend unchanged (no Motoko canister interface/state/schema changes) for this request.",
    "Use English for any user-facing text introduced or modified as part of these changes."
  ],
  "nonGoals": [
    "Do not add new features such as a calendar/availability system or new appointment workflow steps.",
    "Do not change clinic details content (doctor details, phone, timings, address, services) unless required for the logo/theme update."
  ],
  "imageRequirements": {
    "required": [],
    "edits": [
      "Replace the existing generated logo with the newly uploaded logo, preserving the white background exactly (vijaya-children-clinic-logo.dim_512x512.png > vijaya-children-clinic-logo.dim_512x512.png)"
    ]
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}